Podkova/src/Enums/СтатусыЗаказаEDI/СтатусыЗаказаEDI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказаEDI</name>
  <enumValues>
    <name>СогласуетсяПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СогласуетсяПокупателем</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>ИзмененияПодтверждаютсяПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ИзмененияПодтверждаютсяПокупателем</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждаетсяВыполнение</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеОтклонено</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПодтверждаетсяПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПодтверждаетсяПокупателем</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтправке</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/СтатусыЗаказаEDI/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСТаблицейСоответствия

Функция ЗначениеПоИдентификаторуКлиентскогоAPI(Идентификатор) Экспорт 
	
	ТаблицаСоответствий = ТаблицаСтатусовКлиентскогоAPI();
	
	Возврат СоответствиеПоЗначениюСервиса(ТаблицаСоответствий, Идентификатор);
	
КонецФункции

Функция ИдентификаторКлиентскогоAPIПоЗначению(Значение) Экспорт 
	
	ТаблицаСоответствий = ТаблицаСтатусовКлиентскогоAPI();
	
	Возврат СоответствиеПоЗначениюИБ(ТаблицаСоответствий, Значение);
	
КонецФункции

#КонецОбласти

#Область СловарьСтатусов

Функция СтатусБезСтатуса() Экспорт
	
	Возврат "";
	
КонецФункции

Функция СтатусСогласуетсяПродавцом() Экспорт
	
	Возврат "inApprovingBySupplier";
	
КонецФункции

Функция СтатусСогласуетсяПокупателем() Экспорт
	
	Возврат "inApprovingByCustomer";
	
КонецФункции

Функция СтатусВыполняется() Экспорт
	
	Возврат "fulfilling";
	
КонецФункции

Функция СтатусИзмененияПодтверждаютсяПродавцом() Экспорт
	
	Возврат "changeRequestInApprovingBySupplier";
	
КонецФункции

Функция СтатусИзмененияПодтверждаютсяПокупателем() Экспорт
	
	Возврат "changeRequestInApprovingByCustomer";
	
КонецФункции

Функция СтатусПодтверждаетсяВыполнение() Экспорт
	
	Возврат "fulfilledRequestInApproving";
	
КонецФункции

Функция СтатусВыполнениеОтклонено() Экспорт
	
	Возврат "fulfilledRequestRejected";
	
КонецФункции

Функция СтатусВыполнен() Экспорт
	
	Возврат "fulfilled";
	
КонецФункции

Функция СтатусОтменаПодтверждаетсяПокупателем() Экспорт
	
	Возврат "cancelRequestInApprovingByCustomer";
	
КонецФункции

Функция СтатусОтменен() Экспорт
	
	Возврат "canceled";
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеТаблицыСоответствия

Функция ТаблицаСтатусовКлиентскогоAPI()
	
	Результат = ТаблицаСоответствийЗначений();
	
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтатусыЗаказаEDI.ПустаяСсылка(), СтатусБезСтатуса());
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтатусыЗаказаEDI.СогласуетсяПоставщиком, СтатусСогласуетсяПродавцом());
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтатусыЗаказаEDI.СогласуетсяПокупателем, СтатусСогласуетсяПокупателем());
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтатусыЗаказаEDI.Выполняется, СтатусВыполняется());
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтатусыЗаказаEDI.ИзмененияПодтверждаютсяПоставщиком, СтатусИзмененияПодтверждаютсяПродавцом());
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтатусыЗаказаEDI.ИзмененияПодтверждаютсяПокупателем, СтатусИзмененияПодтверждаютсяПокупателем());
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтатусыЗаказаEDI.ПодтверждаетсяВыполнение, СтатусПодтверждаетсяВыполнение());
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтатусыЗаказаEDI.ВыполнениеОтклонено, СтатусВыполнениеОтклонено());
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтатусыЗаказаEDI.Выполнен,СтатусВыполнен());
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтатусыЗаказаEDI.ОтменаПодтверждаетсяПоставщиком, СтатусИзмененияПодтверждаютсяПродавцом());
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтатусыЗаказаEDI.ОтменаПодтверждаетсяПокупателем, СтатусОтменаПодтверждаетсяПокупателем());
	ДобавитьСтрокуСоответствия(Результат, Перечисления.СтатусыЗаказаEDI.Отменен, СтатусОтменен());
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуСоответствия(СоответствиеЗначений, ЗначениеИБ, ЗначениеСервиса)
	
	НоваяСтрока = СоответствиеЗначений.Добавить();
	
	НоваяСтрока.ЗначениеСервиса = ЗначениеСервиса;
	НоваяСтрока.ЗначениеИБ = ЗначениеИБ;
	
КонецПроцедуры

Функция ТаблицаСоответствийЗначений()
	
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("ЗначениеСервиса");
	Результат.Колонки.Добавить("ЗначениеИБ");
	
	Возврат Результат ;
	
КонецФункции

Функция СоответствиеПоЗначениюСервиса(СоответствиеЗначений, ЗначениеДляПоиска)
	
	Результат = СоответствиеЗначений.Найти(ЗначениеДляПоиска, "ЗначениеСервиса");
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.ЗначениеИБ;
	КонецЕсли;
	
КонецФункции

Функция СоответствиеПоЗначениюИБ(СоответствиеЗначений, ЗначениеДляПоиска)
	
	Результат = СоответствиеЗначений.Найти(ЗначениеДляПоиска, "ЗначениеИБ");
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.ЗначениеСервиса;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
